In [1]:
import numpy as np
import pandas as pd

In [17]:
# def make_df(cols, ind):
#     result_dict = {}
#     for i in ind:
#         for c in cols:
#             result_dict[c] = str(c) + str(i)
#     #return pd.DataFrame(result_dict, ind)
#     return result_dict

In [18]:
#make_df('ABC', range(3))

{'A': 'A2', 'B': 'B2', 'C': 'C2'}

In [20]:
data = [{'A': f'A{i}' , 'B': f'B{i}', 'C':f'C{i}'} for i in range(3)]
df = pd.DataFrame(data)
df

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [ ]:
#pd.concat - series

In [22]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D', 'E','F'], index=[4,5,6])

In [23]:
ser1

1    A
2    B
3    C
dtype: object

In [24]:
ser2

4    D
5    E
6    F
dtype: object

In [25]:
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [ ]:
# concat dfs

In [34]:
data = [{'A': f'A{i}' ,'B': f'B{i}'} for i in range(1,3)]
df1 = pd.DataFrame(data, index=[1,2])
         
data2 = [{'A': f'A{i}' , 'B': f'B{i}'} for i in range(3,5)]
df2 = pd.DataFrame(data2, index = [3,4])

In [35]:
df1

    A   B
1  A1  B1
2  A2  B2

In [36]:
df2

    A   B
3  A3  B3
4  A4  B4

In [37]:
pd.concat([df1, df2]) #concat along row - default

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [43]:
data = [{'A': f'A{i}' ,'B': f'B{i}'} for i in range(1)]
df3 = pd.DataFrame(data, index = range(2))
         
data2 = [{'C': f'C{i}' , 'D': f'D{i}'} for i in range(1)]
df4 = pd.DataFrame(data2, index = range(2))

In [44]:
df3

    A   B
0  A0  B0
1  A0  B0

In [45]:
df4

    C   D
0  C0  D0
1  C0  D0

In [46]:
pd.concat([df3, df4], axis=1) #along col, axis = 'columns'

    A   B   C   D
0  A0  B0  C0  D0
1  A0  B0  C0  D0

In [ ]:
#Duplicate indices

In [59]:
x = [{'A': f'A{i}' ,'B': f'B{i}'} for i in range(2)]
df5 = pd.DataFrame(x, index = range(2))
         
y = [{'A': f'A{i}' ,'B': f'B{i}'} for i in range(2,4)]
df6 = pd.DataFrame(y, index = range(2))

In [60]:
df5

    A   B
0  A0  B0
1  A1  B1

In [61]:
df6

    A   B
0  A2  B2
1  A3  B3

In [62]:
pd.concat([df5, df6])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [63]:
#put check - indices should notoverlap
try:
    pd.concat([df5, df6], verify_integrity=True)
except ValueError as e:
    print(f'Valuerror is {e}')

Valuerror is Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [64]:
#ignore existing indices and create new ones
pd.concat([df5, df6], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [66]:
#add multiindex keys
pd.concat([df5, df6], keys=['x', 'y'])

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [ ]:
#concat with joins when different dfs have different col names

In [73]:
x = [{'A': f'A{i}' ,'B': f'B{i}', 'C': f'C{i}'} for i in range(1,3)]
df7 = pd.DataFrame(x, index = range(1,3))
         
y = [{'B': f'B{i}' ,'C': f'C{i}', 'D': f'D{i}'} for i in range(3,5)]
df8 = pd.DataFrame(y, index = range(3,5))

In [74]:
df7

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [75]:
df8

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [76]:
pd.concat([df7, df8])

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [77]:
#show only common columns
pd.concat([df7, df8], join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [ ]:
#reindex method